def number_to_words(n):
    e = ''
    b = ''
    a = {1: 'один', 2: 'два', 3: 'три', 4: 'четыре',
         5: 'пять', 6: 'шесть', 7: 'семь', 8: 'восемь',
         9: 'девять', 10: 'десять', 11: 'одиннадцать', 12: 'двенадцать',
         13: 'тринадцать', 14: 'четырнадцать', 15: 'пятнадцать', 16: 'шеснадцать',
         17: 'семнадцать', 18: 'восемнадцать', 19: 'девятнадцать', 20: 'двадцать',
         30: 'тридцать', 40: 'сорок', 50: 'пятьдесят', 60: 'шестьдесят',
         70: 'семьдесят', 80: 'восемьдесят', 90: 'девяносто',
         }
    for i in range(20):
        if n == i:
            print(a[i])
            exit(0)
    c = str(n)
    d = list(c)
    d[0] = d[0] + '0'
    for i in range(20, 100):
        if d[0] == str(i):
            e = a[i]
    if d[1] != '0':
        for i in range(10):
            if d[1] == str(i):
                b = a[i]
        print(str(e) + ' ' + str(b))
    else:
        print(str(e))


number_to_words(int(input()))